In [1]:
import pandas as pd

In [11]:
df = pd.read_csv("census.csv")

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 129 entries, 0 to 128
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   state            129 non-null    object
 1   state fips       129 non-null    int64
 2   commodity        129 non-null    object
 3   data item        129 non-null    object
 4   domain category  15 non-null     object
 5   2017             127 non-null    object
 6   2012             124 non-null    object
 7   2007             124 non-null    object
 8   2002             124 non-null    object
 9   1997             117 non-null    object
dtypes: int64(1), object(9)
memory usage: 10.2+ KB

In [6]:
df.sample(5)

,state,state fips,commodity,data item,domain category,2017,2012,2007,2002,1997
45,US TOTAL,99,CATTLE,"CATTLE, INCL CALVES - OPERATIONS WITH INVENTORY",NaN,"882,692","913,246","963,669","1,018,359","1,188,659"
92,US TOTAL,99,SOYBEANS,SOYBEANS - ACRES HARVESTED,NaN,"90,149,480","76,104,780","63,915,821","72,399,844","67,773,274"
126,US TOTAL,99,SWEET POTATOES,SWEET POTATOES - ACRES HARVESTED,NaN,"172,983","125,726","105,284","92,310","80,953"
8,US TOTAL,99,FARM OPERATIONS,FARM OPERATIONS - ACRES OPERATED,NaN,"900,217,576","914,527,657","922,095,840","938,279,056","954,752,502"
125,US TOTAL,99,SWEET POTATOES,SWEET POTATOES - OPERATIONS WITH AREA HARVESTED,NaN,"4,798","2,202","1,910","2,366","1,976"

In [16]:
df["domain category"].value_counts()

AREA OPERATED: (1.0 TO 9.9 ACRES)        1
AREA OPERATED: (10.0 TO 49.9 ACRES)      1
AREA OPERATED: (50 TO 179 ACRES)         1
AREA OPERATED: (180 TO 499 ACRES)        1
AREA OPERATED: (500 TO 999 ACRES)        1
AREA OPERATED: (1,000 TO 1,999 ACRES)    1
AREA OPERATED: (2,000 OR MORE ACRES)     1
FARM SALES: (LESS THAN 2,500 $)          1
FARM SALES: (2,500 TO 4,999 $)           1
FARM SALES: (5,000 TO 9,999 $)           1
FARM SALES: (10,000 TO 24,999 $)         1
FARM SALES: (25,000 TO 49,999 $)         1
FARM SALES: (50,000 TO 99,999 $)         1
FARM SALES: (100,000 TO 499,999 $)       1
FARM SALES: (500,000 OR MORE $)          1
Name: domain category, dtype: int64

In [17]:
df["state"].value_counts()

US TOTAL    129
Name: state, dtype: int64

In [ ]:
df[""].value_counts()

In [7]:
clean_df = df.drop(columns = "state", "state fips",)

In [8]:
melt_df

            commodity variable      value
0     FARM OPERATIONS    state   US TOTAL
1     FARM OPERATIONS    state   US TOTAL
2     FARM OPERATIONS    state   US TOTAL
3     FARM OPERATIONS    state   US TOTAL
4     FARM OPERATIONS    state   US TOTAL
...               ...      ...        ...
1156         POTATOES     1997  1,372,458
1157   SWEET POTATOES     1997      1,976
1158   SWEET POTATOES     1997     80,953
1159         ORCHARDS     1997    123,420
1160         ORCHARDS     1997        NaN

[1161 rows x 3 columns]